trwbox/micropython/ports/esp32/network_wlan.c
/*
 * This file is part of the MicroPython project, http://micropython.org/
 *
 * Development of the code in this file was sponsored by Microbric Pty Ltd
 * and Mnemote Pty Ltd
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2016, 2017 Nick Moore @mnemote
 * Copyright (c) 2017 "Eric Poulsen" <eric@zyxod.com>
 * Copyright (c) 2025 "Trent Walraven" <trwbox@gmail.com>
 *
 * Based on esp8266/modnetwork.c which is Copyright (c) 2015 Paul Sokolovsky
 * And the ESP IDF example code which is Public Domain / CC0
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include <string.h>

#include "py/objlist.h"
#include "py/runtime.h"
#include "py/mphal.h"
#include "extmod/modnetwork.h"
#include "modnetwork.h"

#include "esp_wifi.h"
#include "esp_log.h"
#include "esp_psram.h"

#ifndef NO_QSTR
#include "mdns.h"
#endif

#if MICROPY_PY_NETWORK_WLAN

#if (WIFI_MODE_STA & WIFI_MODE_AP != WIFI_MODE_NULL || WIFI_MODE_STA | WIFI_MODE_AP != WIFI_MODE_APSTA)
#error WIFI_MODE_STA and WIFI_MODE_AP are supposed to be bitfields!
#endif

typedef base_if_obj_t wlan_if_obj_t;

static wlan_if_obj_t wlan_sta_obj;
static wlan_if_obj_t wlan_ap_obj;

// Set to "true" if esp_wifi_start() was called
static bool wifi_started = false;

// Set to "true" if the STA interface is requested to be connected by the
// user, used for automatic reassociation.
static bool wifi_sta_connect_requested = false;

// Set to "true" if the STA interface is connected to wifi and has IP address.
static bool wifi_sta_connected = false;

// Store the current status. 0 means None here, safe to do so as first enum value is WIFI_REASON_UNSPECIFIED=1.
static uint8_t wifi_sta_disconn_reason = 0;

#if MICROPY_HW_ENABLE_MDNS_QUERIES || MICROPY_HW_ENABLE_MDNS_RESPONDER
// Whether mDNS has been initialised or not
static bool mdns_initialised = false;
#endif

static uint8_t conf_wifi_sta_reconnects = 0;
static uint8_t wifi_sta_reconnects;

// TODO: Can/should these be dynamically allocated?
static uint8_t scan_config_ssid[33];
static uint8_t scan_config_bssid[6];

static wifi_event_sta_scan_done_t scan_event_data;

// Set to "true" while there is an in-progress scan.
static bool scan_in_progress = false;
// If the scan in progress is a background scan
static bool scan_in_background = false;

// If a soft reset happens between the time a scan has started, and the scan is complete,
// then the callback function provided by the user is no longer valid and should not be called.
// So track the case of a soft-reboot
static bool soft_reboot_happened = false;

// Gets the wifi scan results and returns them as a list of tuples in the expected format.
static mp_obj_t read_wifi_scan_results() {
    ESP_LOGD("wifi", "Reading wifi scan results");

    // Create the list the results will be added to
    mp_obj_t list = mp_obj_new_list(0, NULL);

    uint16_t count = 0;
    esp_exceptions(esp_wifi_scan_get_ap_num(&count));
    if (count == 0) {
        // esp_wifi_scan_get_ap_records must be called to free internal buffers from the scan.
        // But it returns an error if wifi_ap_records==NULL. So allocate at least 1 AP entry.
        // esp_wifi_scan_get_ap_records will then return the actual number of APs in count.
        count = 1;
    }
    // The array to hold the scan results
    wifi_ap_record_t *wifi_ap_records = calloc(count, sizeof(wifi_ap_record_t));
    esp_exceptions(esp_wifi_scan_get_ap_records(&count, wifi_ap_records));
    for (uint16_t i = 0; i < count; i++) {
        // The new tuple for the record with the values (ssid, bssid, channel, rssi, security, hidden)
        mp_obj_tuple_t *t = mp_obj_new_tuple(6, NULL);
        uint8_t *x = memchr(wifi_ap_records[i].ssid, 0, sizeof(wifi_ap_records[i].ssid));
        int ssid_len = x ? x - wifi_ap_records[i].ssid : sizeof(wifi_ap_records[i].ssid);
        t->items[0] = mp_obj_new_bytes(wifi_ap_records[i].ssid, ssid_len);
        t->items[1] = mp_obj_new_bytes(wifi_ap_records[i].bssid, sizeof(wifi_ap_records[i].bssid));
        t->items[2] = MP_OBJ_NEW_SMALL_INT(wifi_ap_records[i].primary);
        t->items[3] = MP_OBJ_NEW_SMALL_INT(wifi_ap_records[i].rssi);
        t->items[4] = MP_OBJ_NEW_SMALL_INT(wifi_ap_records[i].authmode);
        // TODO: This is if the network is hidden, but that is not a direct field in the ESP-IDF scan results.
        //       Potentially check if the SSID has a length of 0 for valid hidden networks?
        t->items[5] = mp_const_false;
        mp_obj_list_append(list, MP_OBJ_FROM_PTR(t));
    }
    // Free the array of scan results
    free(wifi_ap_records);

    ESP_LOGD("wifi", "Read %d scan results into the list", count);
    return list;
}

// This function is used to get execution back into the main MicroPython thread during the wifi event handler
// this is done to allow this function to be able to raise MicroPython exceptions, when setting up and calling
// the user's callback function after a background wifi scan has completed.
static mp_obj_t scan_done_cb(mp_obj_t arg) {
    // TODO: Should this better handle an error in the scan_event_data if there is a problem that occurred during the scan?

    ESP_LOGI("wifi_callback", "status: %lu", scan_event_data.status);

    bool skip_callback = false;
    // Check if a soft reboot happened, making the user callback invalid
    if (soft_reboot_happened) {
        ESP_LOGD("wifi_callback", "Soft reboot happened, skipping user callback");
        // Reset the flag so that it doesn't affect future scans
        soft_reboot_happened = false;
        skip_callback = true;
    }

