trwbox/micropython/ports/esp32/network_wlan.c
    // We always need to save the results from the scan, even if the user callback is not made
    // as that is the only way that the results are freed from memory.
    mp_obj_t results_list = read_wifi_scan_results();

    // The scan is done, so set the pair of flags to false
    scan_in_progress = false;
    scan_in_background = false;

    if (!skip_callback) {
        // Get the user's callback function
        mp_obj_t user_callback = MP_STATE_VM(user_scan_callback);
        // Create a new bool object to indicate the status of the scan
        mp_obj_t status = mp_obj_new_bool(scan_event_data.status == 0);

        // Setup the tuple for the user callback
        mp_obj_t callback_args[2] = {
            status, // The status of the scan
            results_list // The list of results from the scan
        };
        mp_obj_t callback_args_tuple = mp_obj_new_tuple(2, callback_args);

        ESP_LOGD("wifi", "Calling user callback function after scan is complete.");
        // Make the protected call to the user's callback function with the arguments.
        mp_call_function_2_protected(user_callback, MP_OBJ_FROM_PTR(&wlan_sta_obj), callback_args_tuple);
    }

    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(scan_done_cb_obj, scan_done_cb);

// This function is called by the system-event task and so runs in a different
// thread to the main MicroPython task.  It must not raise any Python exceptions.
static void network_wlan_wifi_event_handler(void *event_handler_arg, esp_event_base_t event_base, int32_t event_id, void *event_data) {
    switch (event_id) {
        case WIFI_EVENT_STA_START:
            ESP_LOGI("wifi", "STA_START");
            wlan_sta_obj.active = true;
            wifi_sta_reconnects = 0;
            break;

        case WIFI_EVENT_STA_STOP:
            wlan_sta_obj.active = false;
            break;

        case WIFI_EVENT_STA_CONNECTED:
            ESP_LOGI("network", "CONNECTED");
            break;

        case WIFI_EVENT_STA_DISCONNECTED: {
            // This is a workaround as ESP32 WiFi libs don't currently
            // auto-reassociate.

            wifi_event_sta_disconnected_t *disconn = event_data;
            char *message = "";
            wifi_sta_disconn_reason = disconn->reason;
            switch (disconn->reason) {
                case WIFI_REASON_BEACON_TIMEOUT:
                    // AP has dropped out; try to reconnect.
                    message = "beacon timeout";
                    break;
                case WIFI_REASON_NO_AP_FOUND:
                    // AP may not exist, or it may have momentarily dropped out; try to reconnect.
                    message = "no AP found";
                    break;
                case WIFI_REASON_NO_AP_FOUND_IN_RSSI_THRESHOLD:
                    // No AP with RSSI within given threshold exists, or it may have momentarily dropped out; try to reconnect.
                    message = "no AP with RSSI within threshold found";
                    break;
                case WIFI_REASON_NO_AP_FOUND_IN_AUTHMODE_THRESHOLD:
                    // No AP with authmode within given threshold exists, or it may have momentarily dropped out; try to reconnect.
                    message = "no AP with authmode within threshold found";
                    break;
                case WIFI_REASON_NO_AP_FOUND_W_COMPATIBLE_SECURITY:
                    // No AP with compatible security exists, or it may have momentarily dropped out; try to reconnect.
                    message = "no AP with compatible security found";
                    break;
                case WIFI_REASON_AUTH_FAIL:
                    // Password may be wrong, or it just failed to connect; try to reconnect.
                    message = "authentication failed";
                    break;
                default:
                    // Let other errors through and try to reconnect.
                    break;
            }
            ESP_LOGI("wifi", "STA_DISCONNECTED, reason:%d:%s", disconn->reason, message);

            wifi_sta_connected = false;
            if (wifi_sta_connect_requested) {
                wifi_mode_t mode;
                if (esp_wifi_get_mode(&mode) != ESP_OK) {
                    break;
                }
                if (!(mode & WIFI_MODE_STA)) {
                    break;
                }
                if (conf_wifi_sta_reconnects) {
                    ESP_LOGI("wifi", "reconnect counter=%d, max=%d",
                        wifi_sta_reconnects, conf_wifi_sta_reconnects);
                    if (++wifi_sta_reconnects >= conf_wifi_sta_reconnects) {
                        break;
                    }
                }
                esp_err_t e = esp_wifi_connect();
                if (e != ESP_OK) {
                    ESP_LOGI("wifi", "error attempting to reconnect: 0x%04x", e);
                }
            }
            break;
        }

        case WIFI_EVENT_AP_START:
            wlan_ap_obj.active = true;
            break;

        case WIFI_EVENT_AP_STOP:
            wlan_ap_obj.active = false;
            break;

        case WIFI_EVENT_SCAN_DONE:
            // If the scan was a background scan we need to call the user callback
            if (scan_in_background) {
                ESP_LOGD("wifi", "Scan completed when background scan was requested");
                // This event is triggered whenever a wifi scan completes
                wifi_event_sta_scan_done_t *scan_done = event_data;
                // Copy the scan data to a global so it doesn't get removed before the callback is called
                memcpy(&scan_event_data, scan_done, sizeof(wifi_event_sta_scan_done_t));

                // Since the system thread can't raise exceptions, schedule our handler in the micropython thread
                if (!mp_sched_schedule(MP_OBJ_FROM_PTR(&scan_done_cb_obj), mp_const_none)) {
                    ESP_LOGE("wifi", "Failed to schedule internal scan_done callback");
                }
            } else if (soft_reboot_happened) {
                // Since this method is always called after a scan, it can be used to reset the soft_reset flag
                // if there was not an active background scan happening.
                soft_reboot_happened = false;
            }
            break;
        default:
            break;
    }
}

// This is called from the Ctrl-D soft reboot to handle when there is an in-progress scan.
void network_wlan_deinit(void) {
    if (scan_in_progress) {
        ESP_LOGI("wifi", "soft reboot is happening, while a scan is in progress, setting the flag to ignore scan callback");
        soft_reboot_happened = true;
    }
}

