trwbox/micropython/ports/esp32/network_wlan.c
    wifi_sta_reconnects = 0;
    // connect to the WiFi AP
    MP_THREAD_GIL_EXIT();
    esp_exceptions(esp_wifi_connect());
    MP_THREAD_GIL_ENTER();
    wifi_sta_connect_requested = true;

    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_KW(network_wlan_connect_obj, 1, network_wlan_connect);

static mp_obj_t network_wlan_disconnect(mp_obj_t self_in) {
    wifi_sta_connect_requested = false;
    esp_exceptions(esp_wifi_disconnect());
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(network_wlan_disconnect_obj, network_wlan_disconnect);

static mp_obj_t network_wlan_status(size_t n_args, const mp_obj_t *args) {
    wlan_if_obj_t *self = MP_OBJ_TO_PTR(args[0]);
    if (n_args == 1) {
        if (self->if_id == ESP_IF_WIFI_STA) {
            // Case of no arg is only for the STA interface
            if (wifi_sta_connected) {
                // Happy path, connected with IP
                return MP_OBJ_NEW_SMALL_INT(STAT_GOT_IP);
            } else if (wifi_sta_disconn_reason == WIFI_REASON_NO_AP_FOUND) {
                return MP_OBJ_NEW_SMALL_INT(WIFI_REASON_NO_AP_FOUND);
            } else if (wifi_sta_disconn_reason == WIFI_REASON_NO_AP_FOUND_IN_RSSI_THRESHOLD) {
                return MP_OBJ_NEW_SMALL_INT(WIFI_REASON_NO_AP_FOUND_IN_RSSI_THRESHOLD);
            } else if (wifi_sta_disconn_reason == WIFI_REASON_NO_AP_FOUND_IN_AUTHMODE_THRESHOLD) {
                return MP_OBJ_NEW_SMALL_INT(WIFI_REASON_NO_AP_FOUND_IN_AUTHMODE_THRESHOLD);
            } else if (wifi_sta_disconn_reason == WIFI_REASON_NO_AP_FOUND_W_COMPATIBLE_SECURITY) {
                return MP_OBJ_NEW_SMALL_INT(WIFI_REASON_NO_AP_FOUND_W_COMPATIBLE_SECURITY);
            } else if ((wifi_sta_disconn_reason == WIFI_REASON_AUTH_FAIL) || (wifi_sta_disconn_reason == WIFI_REASON_CONNECTION_FAIL)) {
                // wrong password
                return MP_OBJ_NEW_SMALL_INT(WIFI_REASON_AUTH_FAIL);
            } else if (wifi_sta_disconn_reason == WIFI_REASON_ASSOC_LEAVE) {
                // After wlan.disconnect()
                return MP_OBJ_NEW_SMALL_INT(STAT_IDLE);
            } else if (wifi_sta_connect_requested
                       && (conf_wifi_sta_reconnects == 0
                           || wifi_sta_reconnects < conf_wifi_sta_reconnects)) {
                // No connection or error, but is requested = Still connecting
                return MP_OBJ_NEW_SMALL_INT(STAT_CONNECTING);
            } else if (wifi_sta_disconn_reason == 0) {
                // No activity, No error = Idle
                return MP_OBJ_NEW_SMALL_INT(STAT_IDLE);
            } else {
                // Simply pass the error through from ESP-identifier
                return MP_OBJ_NEW_SMALL_INT(wifi_sta_disconn_reason);
            }
        }
        return mp_const_none;
    }

    // one argument: return status based on query parameter
    switch ((uintptr_t)args[1]) {
        case (uintptr_t)MP_OBJ_NEW_QSTR(MP_QSTR_stations): {
            // return list of connected stations, only if in soft-AP mode
            require_if(args[0], ESP_IF_WIFI_AP);
            wifi_sta_list_t station_list;
            esp_exceptions(esp_wifi_ap_get_sta_list(&station_list));
            wifi_sta_info_t *stations = (wifi_sta_info_t *)station_list.sta;
            mp_obj_t list = mp_obj_new_list(0, NULL);
            for (int i = 0; i < station_list.num; ++i) {
                mp_obj_tuple_t *t = mp_obj_new_tuple(1, NULL);
                t->items[0] = mp_obj_new_bytes(stations[i].mac, sizeof(stations[i].mac));
                mp_obj_list_append(list, t);
            }
            return list;
        }
        case (uintptr_t)MP_OBJ_NEW_QSTR(MP_QSTR_rssi): {
            // return signal of AP, only in STA mode
            require_if(args[0], ESP_IF_WIFI_STA);

            wifi_ap_record_t info;
            esp_exceptions(esp_wifi_sta_get_ap_info(&info));
            return MP_OBJ_NEW_SMALL_INT(info.rssi);
        }
        default:
            mp_raise_ValueError(MP_ERROR_TEXT("unknown status param"));
    }

    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(network_wlan_status_obj, 1, 2, network_wlan_status);

static mp_obj_t network_wlan_scan(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_self, ARG_blocking, ARG_callback, ARG_channel, ARG_ssid, ARG_bssid, ARG_show_hidden,
           ARG_active_scan, ARG_scan_time_passive, ARG_scan_time_active_min, ARG_scan_time_active_max,
           ARG_home_chan_dwell_time};

    static const mp_arg_t allowed_args[] = {
        // Create the list of optional elements that can be given, starting with the self object that
        // will always exist
        { MP_QSTR_self, MP_ARG_REQUIRED | MP_ARG_OBJ, { .u_obj = mp_const_none }},
        // If the scan should be sent to the blocking
        { MP_QSTR_blocking, MP_ARG_KW_ONLY | MP_ARG_BOOL, { .u_bool = true }},
        // Callback function that will be called with the results from the scan after the non-blocking scan has completed
        { MP_QSTR_callback, MP_ARG_KW_ONLY | MP_ARG_OBJ, { .u_obj = mp_const_none }},
        // The channel, or list of channels that should be scanned
        { MP_QSTR_channel, MP_ARG_KW_ONLY | MP_ARG_OBJ, { .u_obj = mp_const_none }},
        // The ssid string that should be scanned for, default of None
        { MP_QSTR_ssid, MP_ARG_KW_ONLY | MP_ARG_OBJ, { .u_obj = mp_const_none }},
        // The mac address bssid that should be scanned for, default is None
        /// TODO: Should this be allowed as bytes, a string or both?
        { MP_QSTR_bssid, MP_ARG_KW_ONLY | MP_ARG_OBJ, { .u_obj = mp_const_none }},
        // If hidden networks should be shown, default of true based on the original implementation
        { MP_QSTR_show_hidden, MP_ARG_KW_ONLY | MP_ARG_BOOL, { .u_bool = true }},
        // If the scan should be active with WIFI_SCAN_TYPE_ACTIVE, default of true based on the ESP-IDF defaults
        { MP_QSTR_active_scan, MP_ARG_KW_ONLY | MP_ARG_BOOL, { .u_bool = true }},
        // Time to passive scan, default 360 ms based on the ESP-IDF defaults
        { MP_QSTR_scan_time_passive, MP_ARG_KW_ONLY | MP_ARG_INT, { .u_int = 360 }},
        // Min time to spend actively scanning, default of 0 ms based on the ESP-IDF defaults
        { MP_QSTR_scan_time_active_min, MP_ARG_KW_ONLY | MP_ARG_INT, { .u_int = 0 }},
        // Max time to spend actively scanning, default of 120 ms based on the ESP-IDF defaults
        { MP_QSTR_scan_time_active_max, MP_ARG_KW_ONLY | MP_ARG_INT, { .u_int = 120 }},
        // Time to spend on the home channel between hops if connected to a wifi network to not lose connection,
        // defaults to 30ms based on the ESP-IDF defaults
        { MP_QSTR_home_chan_dwell_time, MP_ARG_KW_ONLY | MP_ARG_INT, { .u_int = 30 }}
    };

    // Get the args to the function based on the keywords
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    // check that STA mode is active
    wifi_mode_t mode;
    esp_exceptions(esp_wifi_get_mode(&mode));
    if ((mode & WIFI_MODE_STA) == 0) {
        mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("STA must be active"));
    }

    // Raise an error if the scan is already happening
    if (scan_in_progress) {
        mp_raise_msg(&mp_type_RuntimeError, MP_ERROR_TEXT("WiFi scan already in progress, wait for it to finish"));
    } else if (!scan_in_progress && soft_reboot_happened) {
        // This is a weird state to be in, since the soft_reboot flag should only be set when scan_in_progress is set
        ESP_LOGW("wifi", "Scan not in progress with soft_reboot_happened set, resetting the flag");
        // Reset the flag if somehow this is the case
        soft_reboot_happened = false;
    }

    // Create the scan config object to be filled in with the scan parameters
    wifi_scan_config_t config = { 0 };

    config.show_hidden = args[ARG_show_hidden].u_bool;
    config.scan_type = args[ARG_active_scan].u_bool ? WIFI_SCAN_TYPE_ACTIVE : WIFI_SCAN_TYPE_PASSIVE;
    if (mp_obj_get_int(args[ARG_home_chan_dwell_time].u_obj) < 0) {
        mp_raise_ValueError(MP_ERROR_TEXT("home_chan_dwell_time must be a positive integer"));
    } else if (mp_obj_get_int(args[ARG_home_chan_dwell_time].u_obj) > 255) {
        mp_raise_ValueError(MP_ERROR_TEXT("home_chan_dwell_time must be less than 256"));
    }

    config.home_chan_dwell_time = (uint8_t)mp_obj_get_int(args[ARG_home_chan_dwell_time].u_obj);

    // Set the scan times
    if (mp_obj_get_int(args[ARG_scan_time_passive].u_obj) < 0) {
        mp_raise_ValueError(MP_ERROR_TEXT("scan_time_passive must be a positive integer"));
    } else if (mp_obj_get_int(args[ARG_scan_time_passive].u_obj) > 1500) {
        // TODO: Is there a better way to give these warnings?
        ESP_LOGW("wifi", "scan_time_passive is greater than the recommended maximum of 1500ms");
    }
    config.scan_time.passive = mp_obj_get_int(args[ARG_scan_time_passive].u_obj);

    if (mp_obj_get_int(args[ARG_scan_time_active_min].u_obj) < 0) {
        mp_raise_ValueError(MP_ERROR_TEXT("scan_time_active_min must be a positive integer"));
    }
    if (mp_obj_get_int(args[ARG_scan_time_active_max].u_obj) < 0) {
        mp_raise_ValueError(MP_ERROR_TEXT("scan_time_active_max must be a positive integer"));
    } else if (mp_obj_get_int(args[ARG_scan_time_active_max].u_obj) > 1500) {
        // TODO: Is there a better way to give these warnings?
        ESP_LOGW("wifi", "scan_time_active is greater than the recommended maximum of 1500ms");
    }
    if (mp_obj_get_int(args[ARG_scan_time_active_min].u_obj) > mp_obj_get_int(args[ARG_scan_time_active_max].u_obj)) {
        mp_raise_ValueError(MP_ERROR_TEXT("scan_time_active_min must be less than or equal to scan_time_active_max"));
    }
    config.scan_time.active.min = mp_obj_get_int(args[ARG_scan_time_active_min].u_obj);
    config.scan_time.active.max = mp_obj_get_int(args[ARG_scan_time_active_max].u_obj);

    if (args[ARG_ssid].u_obj != mp_const_none) {
        size_t len;
        const char *str;

        str = mp_obj_str_get_data(args[ARG_ssid].u_obj, &len);
        // Maximum length of the SSID is 32 bytes, array is 33 bytes to include the null terminator
        if (len >= sizeof(scan_config_ssid)) {
            mp_raise_ValueError(MP_ERROR_TEXT("SSID too long"));
        }
        // TODO: Should there be a check for SSID length of 0?
        memcpy(scan_config_ssid, str, len);
        config.ssid = scan_config_ssid;
    }

