trwbox/micropython/ports/esp32/network_wlan.c
    if (args[ARG_bssid].u_obj != mp_const_none) {
        size_t len;
        const char *str;

        str = mp_obj_str_get_data(args[ARG_bssid].u_obj, &len);
        if (len != sizeof(scan_config_bssid)) {
            mp_raise_ValueError(MP_ERROR_TEXT("BSSID must be 6 bytes"));
        }
        memcpy(scan_config_bssid, str, sizeof(scan_config_bssid));
        config.bssid = scan_config_bssid;
    }

    if (mp_obj_is_int(args[ARG_channel].u_obj)) {
        // If the channel argument is a single channel, set the channel in the config
        // TODO: This check won't be good enough if support for 5GHz is added with the esp32-c5
        if (mp_obj_get_int(args[ARG_channel].u_obj) > 14 || mp_obj_get_int(args[ARG_channel].u_obj) < 1) {
            mp_raise_ValueError(MP_ERROR_TEXT("Unsupported channel number"));
        }

        config.channel = mp_obj_get_int(args[ARG_channel].u_obj);
    } else if (mp_obj_is_type(args[ARG_channel].u_obj, &mp_type_list) || mp_obj_is_type(args[ARG_channel].u_obj, &mp_type_tuple)) {
        // If channel argument is a list or tuple, try to use the channel bitmap to scan them all

        #if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 3, 0)
        // The channel bitmap only supports ESP-IDF versions 5.3.0 and above
        // Start with the empty bitmap
        wifi_scan_channel_bitmap_t channel_bitmap = {0};

        // Get the list of channels
        mp_obj_t channel_list = args[ARG_channel].u_obj;
        int channel_count = mp_obj_get_int(mp_obj_len(channel_list));

        // TODO: Should there be a check if there are more than the maximum number of channels?
        if (channel_count == 0) {
            mp_raise_ValueError(MP_ERROR_TEXT("No channels given in channel list"));
        }

        // Get the channels themselves
        mp_obj_t *items;
        mp_obj_get_array_fixed_n(channel_list, channel_count, &items);
        for (int i = 0; i < channel_count; i++) {
            if (!mp_obj_is_int(items[i])) {
                mp_raise_TypeError(MP_ERROR_TEXT("The wifi channels must be specified as integers"));
            }

            // Check that it is a valid channel
            int temp_channel_number = mp_obj_get_int(items[i]);
            // TODO: This check won't be good enough if support for 5GHz is added with the esp32-c5
            // TODO: Should this also check for duplicate channels?
            if (temp_channel_number > 1 || temp_channel_number < 14) {
                mp_raise_ValueError(MP_ERROR_TEXT("Unsupported channel number in channel list"));
            }

            // Set the channel in the bitmap
            channel_bitmap.ghz_2_channels |= 1 << (temp_channel_number);
        }

        // Set the channel bitmap, and clear the channel number since 0 is required for the bitmap
        config.channel = 0;
        config.channel_bitmap = channel_bitmap;
        #else
        // If the version is less than 5.3.0, raise an error when trying to use a list or tuple of channels
        mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("Using a list of channels is not supported on this version of ESP-IDF"));
        #endif
    } else if (args[ARG_channel].u_obj == mp_const_none) {
        // If no channel is given, set the channel to 0 to scan all channels
        config.channel = 0;
    } else {
        // If it is neither of those, raise an error
        mp_raise_msg(&mp_type_TypeError, MP_ERROR_TEXT("Channel must be an integer or a list of integers"));
    }

    // If the scan is non-blocking, run checks on the callback
    if (args[ARG_blocking].u_bool == false) {
        // Check that a callback is given
        if (args[ARG_callback].u_obj == mp_const_none) {
            mp_raise_TypeError(MP_ERROR_TEXT("Callback must be given for non-blocking scan"));
        }

        // Check that the callback is a callable object
        if (!mp_obj_is_callable(args[ARG_callback].u_obj)) {
            mp_raise_TypeError(MP_ERROR_TEXT("Callback must be a callable object"));
        }

        // Set the callback to the global callback object
        MP_STATE_VM(user_scan_callback) = args[ARG_callback].u_obj;
        // TODO: Save the callback to a global object, so it can be used in the event handler
        // TODO: Should the callback be ran on blocking scans too?
        // I don't think so, since that could lead to backwards compatibility issues.
    } else if (args[ARG_callback].u_obj != mp_const_none) {
        // If the scan is blocking, but a callback is given, raise an error
        mp_raise_TypeError(MP_ERROR_TEXT("Callback cannot be given for blocking scan"));
    }

    MP_THREAD_GIL_EXIT();
    // Set the flags for the scan that is going to happen
    scan_in_progress = true;
    scan_in_background = !args[ARG_blocking].u_bool;
    esp_err_t status = esp_wifi_scan_start(&config, args[ARG_blocking].u_bool);
    MP_THREAD_GIL_ENTER();

    if (!args[ARG_blocking].u_bool) {
        // If this is a non-blocking scan check the error code
        // TODO: Choosing not to use esp_exceptions here to make it more clear it was a non-blocking scan,
        //       but unsure if that is the correct approach.
        if (status != ESP_OK) {
            // Clear the scan in flags if there was an error
            scan_in_progress = false;
            scan_in_background = false;
            mp_raise_msg_varg(&mp_type_OSError, MP_ERROR_TEXT("Non-blocking WiFi scan failed: %s"), esp_err_to_name(status));
        }

        // Then return None immediately since the callback will handle the rest
        return mp_const_none;
    }

    // If the scan was blacking, it will have completed or errored by reaching this code
    // Verify the status of the scan
    esp_exceptions(status);
    // If the scan was successful, read the results and return them
    mp_obj_t list = read_wifi_scan_results();
    // Clear the scan in progress flag
    scan_in_progress = false;
    return list;
}
static MP_DEFINE_CONST_FUN_OBJ_KW(network_wlan_scan_obj, 1, network_wlan_scan);

// TODO: Should this be a property somehow instead of a method?
static mp_obj_t network_wlan_in_progress(mp_obj_t self_in) {
    return mp_obj_new_bool(scan_in_progress);
}
static MP_DEFINE_CONST_FUN_OBJ_1(network_wlan_in_progress_obj, network_wlan_in_progress);

static mp_obj_t network_wlan_isconnected(mp_obj_t self_in) {
    wlan_if_obj_t *self = MP_OBJ_TO_PTR(self_in);
    if (self->if_id == ESP_IF_WIFI_STA) {
        return mp_obj_new_bool(wifi_sta_connected);
    } else {
        wifi_sta_list_t sta;
        esp_wifi_ap_get_sta_list(&sta);
        return mp_obj_new_bool(sta.num != 0);
    }
}
static MP_DEFINE_CONST_FUN_OBJ_1(network_wlan_isconnected_obj, network_wlan_isconnected);

static mp_obj_t network_wlan_config(size_t n_args, const mp_obj_t *args, mp_map_t *kwargs) {
    if (n_args != 1 && kwargs->used != 0) {
        mp_raise_TypeError(MP_ERROR_TEXT("either pos or kw args are allowed"));
    }

    wlan_if_obj_t *self = MP_OBJ_TO_PTR(args[0]);

    bool is_wifi = self->if_id == ESP_IF_WIFI_AP || self->if_id == ESP_IF_WIFI_STA;

    wifi_config_t cfg;
    if (is_wifi) {
        esp_exceptions(esp_wifi_get_config(self->if_id, &cfg));
    }

